Revit 2027 API
ViewDisplayModel.EnableSilhouettes Property
 True to show silhouettes edges. False to disable showing them.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool EnableSilhouettes { get; set; }
Public Property EnableSilhouettes As Boolean
	Get
	Set
public:
property bool EnableSilhouettes {
	bool get ();
	void set (bool value);
}
member EnableSilhouettes : bool with get, set
Property Value
Boolean
See Also
Reference
ViewDisplayModel Class
Autodesk.Revit.DB Namespace